/**
 * Класс для хранения сообщений пользователю.
 */
public class Messages {

    /**
     * Сообщение с информацией о запуске утилиты.
     */
    public static final String utilityLaunchCommandMessage = new StringBuilder()
            .append("Для запуска утилиты используйте команду такого вида:\n")
            .append("java -jar file-content-filtering-utility.jar [-o <выходной_путь>] ")
            .append("[-p <выходной_префикс>] [-a] [-s] [-f] <входные_файлы>")
            .toString();

    /**
     * Сообщение с информацией об поддерживаемых аргументах.
     */
    public static final String argsInfoMessage = new StringBuilder()
            .append("-o : аргумент для указания пути результатов;\n")
            .append("-p : аргумент для указания префикса имен выходных файлов;\n")
            .append("-a : аргумент для активации режима добавления данных в существ. файлы (по-умолчанию файлы перезаписываются); \n")
            .append("-s : аргумент для активации вывода краткой статистики;\n")
            .append("-f : аргумент для активации вывода полной статистики;\n")
            .append("<входные_файлы> : файлы, содержимое которых фильтруется (с расширением).\n")
            .toString();
}
